# Phase 1 Project

## Introduction

In this project, I aim to explore what types of films are currently doing best at the box office based on given datasets present in the ```./Data``` folder. My aim is to advise Microsoft on what types of movies they should create in their newly built movie studio.

## Exploring Datasets

In [2]:
! ls ./data/

bom.movie_gross.csv  rt.movie_info.tsv	tmdb.movies.csv
im.db		     rt.reviews.tsv	tn.movie_budgets.csv

In [1]:
import numpy as np
import pandas as pd
import sqlite3
from matplotlib import pyplot as plt

#### Imdb data

##### Box Office Mojo csv

In [2]:
bom_df = pd.read_csv("./data/bom.movie_gross.csv")
bom_df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [5]:
bom_df.columns

Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

In [9]:
bom_df.index

RangeIndex(start=0, stop=3387, step=1)

In [12]:
bom_df.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

##### Imdb database

In [3]:
conn = sqlite3.connect("./data/im.db")
db_tables_q = """
SELECT name
FROM sqlite_master
WHERE type = 'table'
;
"""
pd.read_sql(db_tables_q, conn)

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [10]:
movie_basics_q = """
SELECT *
FROM movie_basics
;
"""
imdb_movie_basics_df = pd.read_sql(movie_basics_q, conn)
imdb_movie_basics_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [11]:
imdb_movie_basics_df.index

RangeIndex(start=0, stop=146144, step=1)

In [12]:
imdb_movie_basics_df.isna().sum()

movie_id               0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [14]:
movie_ratings_q = """
SELECT *
FROM movie_ratings
;
"""
imdb_movie_ratings_df = pd.read_sql(movie_ratings_q, conn)
imdb_movie_ratings_df.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [15]:
imdb_movie_ratings_df.index

RangeIndex(start=0, stop=73856, step=1)

In [16]:
imdb_movie_ratings_df.isna().sum()

movie_id         0
averagerating    0
numvotes         0
dtype: int64

#### Rotten Tomatoes data

##### Movie Info tsv

In [5]:
rt_movie_info_df = pd.read_csv("./data/rt.movie_info.tsv", delimiter="\t")
rt_movie_info_df.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [27]:
rt_movie_info_df.index

RangeIndex(start=0, stop=1560, step=1)

In [28]:
rt_movie_info_df.isna().sum()

id                 0
synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64

##### Movie reviews tsv

In [6]:
rt_reviews_df = pd.read_csv("./data/rt.reviews.tsv", delimiter="\t", encoding='windows-1252')
rt_reviews_df.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

In [33]:
rt_reviews_df.index

RangeIndex(start=0, stop=54432, step=1)

In [41]:
rt_reviews_df.isna().sum()

id                0
review         5563
rating        13517
fresh             0
critic         2722
top_critic        0
publisher       309
date              0
dtype: int64

#### The MovieDB data

In [7]:
tmdb_df = pd.read_csv("./data/tmdb.movies.csv", index_col=0)
tmdb_df.head()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [47]:
tmdb_df.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            26507, 26508, 26509, 26510, 26511, 26512, 26513, 26514, 26515,
            26516],
           dtype='int64', length=26517)

In [48]:
tmdb_df.isna().sum()

genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

#### The Numbers data

In [8]:
tn_df = pd.read_csv("./data/tn.movie_budgets.csv", index_col=0)
tn_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [52]:
tn_df.index

Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10,
            ...
            73, 74, 75, 76, 77, 78, 79, 80, 81, 82],
           dtype='int64', name='id', length=5782)

In [53]:
tn_df.isna().sum()

release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

### Choosing Datasets to Use

After reviewing the different datasets available, I have chosen to use Imdb, The MovieDB and The Numbers datasets. Rotten Tomatoes and Box Office Mojo datasets have a huge percentage of missing values.

## Data Preparation

Joining Imdb tables to get both genres and ratings of movies on one table.

In [18]:
imdb_q = """
SELECT *
FROM movie_basics mb
    JOIN movie_ratings USING(movie_id)
WHERE mb.genres IS NOT NULL
;
"""
imdb_df = pd.read_sql(imdb_q ,conn)
imdb_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

Cleaning Imdb dataframe

In [19]:
imdb_df.index

RangeIndex(start=0, stop=73052, step=1)

In [20]:
imdb_df.isna().sum()

movie_id              0
primary_title         0
original_title        0
start_year            0
runtime_minutes    7332
genres                0
averagerating         0
numvotes              0
dtype: int64

In [31]:
imdb_df["primary_title"].duplicated().sum()

3804

In [39]:
imdb_df.drop_duplicates(subset=["primary_title"], keep="first", inplace=True)

In [43]:
imdb_df["original_title"].duplicated().sum()

161

In [44]:
imdb_df.drop_duplicates(subset=["original_title"], keep="first", inplace=True)

In [46]:
len(imdb_df)

69087

Joining The MovieDB data with Imdb data to get alternative movie ratings data.

In [89]:
tmdb_and_imdb_df = tmdb_df.merge(imdb_df, on="original_title", suffixes=("_tmdb", "_imdb"))
tmdb_and_imdb_df = tmdb_and_imdb_df[["original_title", "vote_average", "vote_count", "genres"]]
tmdb_and_imdb_df.head()

,original_title,vote_average,vote_count,genres
0,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,"Adventure,Fantasy,Mystery"
1,How to Train Your Dragon,7.7,7610,"Action,Adventure,Animation"
2,Iron Man 2,6.8,12368,"Action,Adventure,Sci-Fi"
3,Inception,8.3,22186,"Action,Adventure,Sci-Fi"
4,Percy Jackson & the Olympians: The Lightning T...,6.1,4229,"Adventure,Family,Fantasy"

Cleaning ```tmdb_and_imdb_df```

In [90]:
len(tmdb_and_imdb_df)

14937

In [91]:
tmdb_and_imdb_df.duplicated().sum()

807

In [92]:
tmdb_and_imdb_df.drop_duplicates(keep="first", inplace=True)

In [93]:
tmdb_and_imdb_df["original_title"].duplicated().sum()

585

In [94]:
tmdb_and_imdb_df.drop_duplicates(subset=["original_title"], keep="first", inplace=True)

In [95]:
len(tmdb_and_imdb_df)

13545

Joining The Numbers data with Imdb data to review Box Office financial performance.

In [78]:
tn_and_imdb_df = tn_df.merge(
    imdb_df, left_on="movie", right_on="primary_title", suffixes=("_tn", "imdb"))
tn_and_imdb_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",tt1775309,Avatar,AbatÃ¢,2011,93.0,Horror,6.1,43
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",tt1298650,Pirates of the Caribbean: On Stranger Tides,Pirates of the Caribbean: On Stranger Tides,2011,136.0,"Action,Adventure,Fantasy",6.6,447624
2,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",tt6565702,Dark Phoenix,Dark Phoenix,2019,113.0,"Action,Adventure,Sci-Fi",6.0,24451
3,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",tt2395427,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi",7.3,665594
4,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200",tt4154756,Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi",8.5,670926

In [79]:
len(tn_and_imdb_df)

2169

In [80]:
tn_and_imdb_df.duplicated().sum()

0

In [83]:
tn_and_imdb_df["movie"].duplicated().sum()

56

In [84]:
tn_and_imdb_df.drop_duplicates(subset=["movie"], keep="first", inplace=True)

In [85]:
len(tn_and_imdb_df)

2113